readme: 거래구조 다이어그램 수정
